Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/working_abroad/working_in_the_eu.html.txt.tmx
Source language: en
Languages: ga

source: Working in the EU
ga: Ag obair san AE

source: • EU Directives on free movement of workers
ga: • Treoracha de chuid an AE maidir le saorghluaiseacht oibrithe

source: As a European Union (EU) citizen, you have the right to live and work in any other EU country
ga: Mar shaoránach den Aontais Eorpaigh (AE), tá sé de cheart agat maireachtáil agus oibriú in aon cheann de thíortha an AE

source: If you are an EU national or a dependant of such a national and you meet the requirements of the EU Directives on free movement of workers, you may not, in general, be refused permission to land in another EU country
ga: Más saoránach den AE thú nó cleithiúnach saoránaigh agus má shásaíonn tú riachtanais Treoracha an AE maidir le saorthaisteal oibrithe, ní féidir, go ginearálta, diúltú duit dul i dtír in aon tír eile den AE

source: You may require a valid identity card or passport
ga: Beidh cárta aitheantais bhailí nó pas ag teastáil uait

source: You may be refused entry and/or your right of residence in another member state may be restricted on grounds of public policy, public security, or public health
ga: Féadfar a dhiúltú duit dul isteach i mballstát eile nó féadfar do cheart cónaithe i mballstát eile a dhiúltú duit ar fhorais beartais phoiblí, slándáil an phobail nó sláinte an phobail

source: The rights outlined in this section broadly apply to the non-EU States in the European Economic Area, that is, Norway, Iceland and Liechtenstein, as well as to Switzerland
ga: Tá na cearta a dtugtar sracléiriú orthu sa roinn seo infheidhme go ginearálta maidir leis na Ballstáit neamh-AE de chuid an Limistéir Eorpaigh Eacnamaíoch, is é sin, an Iorua, an Íoslann agus Lichtinstéin, chomh maith leis an Eilvéis

source: EU Directives on free movement of workers
ga: Treoracha de chuid an AE maidir le saorghluaiseacht oibrithe

source: If you are an EU national moving to another EU country to take up employment or self-employment or to provide a service, the Directives cover you
ga: Más náisiúnach de chuid an AE tú atá ag aistriú go dtí tír eile de chuid an AE chun dul i mbun fostaíochta nó féinfhostaíochta nó chun seirbhís a sholáthar, tagann tú faoi chumhdach na dTreoracha

source: Members of your family, whatever their nationality, have the right to accompany you or to join you in your country of employment
ga: Tá an ceart ag daoine de do theaghlach, cibé náisiúntacht atá acu, dul in éineacht leat nó dul amach chugat i dtír d’fhostaíochta

source: Your family is defined as your spouse and your children who are under 21 years of age (or older if they are dependent on you) and their spouses, as well as your parents and your parents-in-law, if they are dependent on you
ga: Is é an míniú a thugtar ar do theaghlach ná do chéile agus do leanaí atá faoi bhun 21 bliain d’aois (nó níos sine más cleithiúnaithe de do chuidse iad) agus a gcéilí, mar aon le do thuismitheoirí agus tuismitheoirí do chéile, más cleithiúnaithe de do chuidse iad

source: Your registered partner (and dependent relatives) is also entitled to move with you if the host member state treats registered partnerships as equivalent to marriage
ga: Tá do pháirtí cláraithe (agus gaolta cleithiúnacha) i dteideal freisin aistriú in éineacht leat má dhéileálann an ballstát is óstach le comhpháirtíochtaí cláraithe mar chomhpháirtíocht atá coibhéiseach leis an bpósadh

source: The host member state must facilitate the entry and residence of other family members who do not have an absolute right to move but who are dependent on you or whose health is such that they require care by you
ga: Ní mór don bhallstát is óstach teacht isteach agus cónaí daoine eile den teaghlach, nach bhfuil láncheart acu aistriú ach atá ina gcleithiúnaithe de do chuidse nó go dteastaíonn do chúram uathu mar gheall ar a sláinte, a éascú

source: Member states must also facilitate the entry and resident the entry and residence of a partner with whom you have a durable relationship
ga: Ní mór do bhallstáit dul isteach agus cónaí páirtí lena bhfuil caidreamh buanseasmhach agat a éascú freisin

source: EU citizens exercising their right to free movement are not required to have a residence card but their family members who are not themselves EU citizens may be required to have such a card
ga: Ní cheanglaítear ar shaoránaigh de chuid an AE a fheidhmíonn an ceart atá acu chun saorghluaiseachta cárta cónaithe a bheith acu ach féadfar a cheangal ar dhaoine dá dteaghlaigh nach saoránaigh de chuid an AE iad féin cárta den sórt sin a bheith acu

source: If they wish to, your spouse, civil partner and children also have the right to work without restriction in your country of employment
ga: Más mian leo é, tá an ceart ag do chéile, do pháirtnéir sibhialta agus do leanaí dul i mbun oibre gan srianadh i dtír d’fhostaíochta

source: You and your family members have the right to the same social benefits as the nationals of the host member state
ga: Tá an ceart agat agus ag na daoine de do theaghlach chun na sochar sóisialach céanna atá ag náisiúnaigh de chuid an bhallstáit is óstach

source: This includes the right to education access and benefits
ga: Folaíonn sin an ceart chun rochtain ar oideachas agus chun sochar

source: Members of your family who come from a non-EU country may be asked for an entry visa by the country of employment
ga: Féadfaidh tír na fostaíochta víosa iontrála a iarraidh ar dhaoine de do theaghlach as tír neamh-AE

source: This visa is granted quite easily and should be free of charge
ga: Deonaítear an víosa sin go héasca agus ba chóir go mbeidh sé saor in aisce

source: You are entitled to be recruited under the same conditions as nationals of the country in which you are seeking work and cannot be asked to meet any additional requirements
ga: Tá sé de cheart agat post a fháil faoi na coinníollacha céanna a bhaineann le saoránaigh den tír ina bhfuil tú ag lorg oibre inti agus ní féidir le fostóir aon riachtanais bhreise a éileamh ort

source: This means that you can apply for any job vacancy advertised in any EU country, including public sector jobs
ga: Mar sin is féidir leat iarratas a dhéanamh ar aon phost fógraithe in aon tír san AE, postanna sa rannóg phoiblí san áireamh

source: However, certain public service posts may be restricted to nationals of a particular country where the job in question involves safeguarding public order or the interests of the state, for example, the armed forces and police
ga: Ach, d'fhéadfadh sé go mbeadh postanna faoi leith sa tseirbhís phoiblí teoranta chuig saoránaigh den tír ina bhfuileadar má tá cúram ord poiblí nó spéiseanna eile den stát, mar shampla, na forsaí cosanta agus na poilíní i gceist

source: Recognition of qualifications in the EU
ga: Aitheantas ar do chailíochtaí san AE

source: Some EU countries require diplomas, titles, certificates or other special qualifications as a condition for access to certain salaried and self-employed occupations
ga: Bíonn cuid de na tíortha san AE ag iarraidh go mbeadh dioplómaí, teidil, teastais nó cáilíochtaí eile speisialta ag daoine mar riachtanas iontrála chuig slithe beatha tuarastail nó féin-fhostaithe faoi leith

source: It can be difficult to have your own training and skills fully recognised
ga: Is minic go mbíonn deacrachtaí ann aitheantas iomlán a fháil ar an oiliúint agus ar na scileanna atá agat

source: The EU has therefore set up systems for recognising diplomas and training that enable you to make full use of your training and skills in another EU country
ga: Tá córas curtha i bhfeidhm mar sin ag an AE le haitheantas a thabhairt do dioplómaí agus d'oiliúint a chuireann ar do chumas úsáid iomlán a bhaint as an oiliúint atá ort agus as do scileanna i dtír eile de chuid an AE

source: The basic principle is that if you are qualified to exercise a profession in your home country, you are qualified to exercise the same profession in any other EU country
ga: Mar bhunphrionsabal má tá cáilíocht ort i slí bheatha i do thír féin tabharfar aitheantas duit an tslí bheatha sin a leanúint in aon tír eile de chuid an AE

source: A general system of recognition of qualifications that is applicable to most regulated professions has been put in place across the EU
ga: Tá córas ginearálta maidir le aitheantas a thabhairt do cháilíochtaí proifisiúnta curtha i bhfeidhm ar fud an AE

source: So, if you wish to work in a profession (as a teacher, lawyer, engineer or psychologist, for example) that is regulated in the country of employment, you must apply for recognition of your qualifications in that country
ga: Mar sin más mian leat dul ag obair i ngairm faoi leith (múinteoir, innealtóir, síceolaí, mar shampla) a bhfuil rialacha ag baint leis sa tír ina bhfuil tú le bheith fostaithe inti ní mór duit iarratas a dhéanamh ar aitheantas a fháil sa tír sin ar na cáilíochtaí atá agat

source: The authorities have 4 months in which to reply
ga: Ní mór do na húdaráis scéal a chur chugat maidir le d'iarratas taobh istigh de cheithre mhí

source: If they consider that your training is significantly different in terms of duration or content from that given in the host country, you may be asked to obtain either additional professional experience completing your training, or to take a training course or to take an aptitude test
ga: Má cheapann siad go bhfuil difríocht mhór idir an oiliúint a cuireadh ortsa i dtaobh fad agus ábhair ón oiliúint a cuirtear ar fáil sa tír sin, d'fhéadfadh sé go mbeadh ort taithí phroifisiúnta bhreise a fháil le cur leis an oiliúint, nó cúrsa traenála a dhéanamh nó fiú scrúdú mianaigh a dhéanamh

source: If you are a doctor, a general nurse, a dentist, a midwife, a vet, a pharmacist or an architect, your national qualifications are in principle recognised automatically
ga: Más dochtúir, banaltra ghinearálta, fiaclóir, bean chabhartha, tréidlia, poitigéir nó ailtire thú is iondúil go dtugtar aitheantas ar an bpointe do do chuid cáilíochtaí

source: If your profession is not regulated in the country in which you wish to work, no recognition of your qualifications is required
ga: Muna bhfuil rialacha faoi leith ag baint le do shlí bheatha sa tír ina bhfuil spéis agat oibriú inti, ní gá aitheantas ar do chuid cáilíochtaí a lorg

source: Looking for a job in the EU
ga: Ag lorg fostaíochta san AE

source: The EURES network was established by the European Commission to help European citizens looking for work in another country in the EU/EEA
ga: Bhunaigh Coimsiún na hEorpa an gréasán EURES le cabhrú le saoránaigh Eorpacha atá ar lorg oibre i dtír eile san AE/LEE

source: EURES has a network of advisers, known as EURES advisers, who can give you general practical information on legislation, social security, living conditions, useful addresses, information on pay levels, taxes, contracts, recruitment practices, etc
ga: Tá gréasán de chomhairleoirí an EURES, ar a dtugtar comhairleoirí EURES, ar féidir leo eolas praicticiúil a thabhairt duit ar reachtaíocht, leas sóisialta, dálaí maireachtála, seoltaí úsáideacha, eolas ar leibhéil íocaíochta, chánacha, chonarthaí, nósanna earcaíochta, srl

source: They also have access to the EURES job vacancies database with vacancies in the EU/EEA
ga: Tá rochtain acu fosta chuig bunachar sonraí folúntais oibre EURES le folúntais san AE /LEE

source: If you are interested in working or seeking work within the EU/EEA, make an appointment with your nearest EURES advisor
ga: Más suim leat a bheith ag obair nó a bheith ar lorg oibre san AE/LEE, déan coinne le do chomhairleoir EURES is cóngaraí

source: Contact your nearest employment services office or Intreo centre for more information
ga: Déan teagmháil le d' oifig seirbhísí fostaíochta nó ionad Intreo is congaraí chun tuilleadh eolais a fháil

source: You can access the EURES job vacancies database yourself from the EURES site
ga: Is féidir leat dul isteach ar bhunachar sonraí folúntais oibre EURES tú féin ón láithreán EURES

source: Each vacancy in the database is provided with contact details at the bottom of the page
ga: Bíonn sonraí teagmhála ann le gach folúntas sa bhunachar sonraí ar bhun an leathanaigh

source: If you are unemployed, you have the right to live in another EU country for a "reasonable period" of time in order to look for a job
ga: Más duine dífhostaithe thú tá sé de cheart agat maireachtáil ar feadh "tréimhse réasúnta" i dtír eile den AE le deis a thabhairt duit post a fháil

source: In the absence of a definition of "reasonable period", most EU countries are now operating a 6-month period, though some EU countries are still operating a 3-month period
ga: Muna bhfuil aon tréimhse faoi leith leagtha síos ag tír mar "thréimhse réasúnta" is iondúil gur tréimhse de shé mhí a chuireann tíortha den AE i bhfeidhm, cé go bhfuil cuid acu fós ag cur tréimhse de 3 mhí i bhfeidhm

source: You are advised to check the exact situation with the national authorities of the EU country in which you are looking for work
ga: Is fearr an scéal a fhiosrú leis na húdaráis chuí sa tír ina bhfuil tú ag dul ag lorg oibre inti

source: However, no matter how long you have to look for a job, you cannot be asked to leave the country if you can prove that you are genuinely looking for a job and that you have a real chance of finding one
ga: Ach, is cuma cén fhad a thugtar duit post a lorg ní féidir iarraidh ort an tír a fhágáil más féidir leat a chruthú go bhfuil tú i ndáiríre ag lorg fostaíochta agus go bhfuil seans mhaith ann go dtiocfaidh tú ar an bpost sin

source: For example, you have still got interviews or tests to attend
ga: Mar shampla, d'fhéadfadh sé go mbeadh agallaimh nó scrúduithe socraithe agat le freastal orthu

source: You can register at employment agencies and centres without being resident in the country in which you wish to work and you will be given the same help to find work as nationals of that country
ga: Is féidir leat clárú le heagraíochtaí agus le hionaid fhostaíochta i dtír fiú muna bhfuil cónaí agat inti más mian leat dul ag obair sa tír sin agus cuirfear an cúnamh céanna ar fáil duit agus a fhaigheann saoránaigh na tíre sin

source: Transferring your unemployment benefit
ga: Ag aistriú sochair dífhostaíochta

source: If you are drawing unemployment benefit in one member state, you may continue to draw benefit from that same country for up to 13 weeks after you move to another member state
ga: Má tá sochar dífhostaíochta dhá íoc leat i mballstát amháin, is féidir leanúint ort leis an sochar sin a fháil ón tír chéanna ar feadh 13 sheachtain tar éis duit imeacht chuig ballstát eile

source: This is provided that you have been available to the employment services in the country where you have been drawing unemployment benefit for at least 4 weeks
ga: Íocfar an sochar ar an gcoinníoll go raibh tú ar fáil do na seirbhísí fostaíochta sa tír ina raibh tú ag fáil an tsochair ar feadh, ar a laghad, 4 sheachtain

source: If you apply to transfer your benefit it will be paid directly to you
ga: Má iarrann tú do shochar a aistriú thar lear íocfar é leat go díreach

source: You will still be required to register with the employment services of the country where you have gone to look for work within a week
ga: Ní mór duit clárú leis na seirbhísí fostaíochta sa tír ina bhfuil tú ar lorg oibre laistigh seachtain amháin

source: Also you may now transfer your benefit more than once while you are unemployed provided you do not exceed the maximum period of 13 weeks
ga: Is féidir leat do shochar a aistriú níos mó ná uair amháin agus atá tú dífhostaithe freisin ar choinníoll nach dtéann tú thar an uasteorainn 13 seachtaine

source: If you do not find work, you must return to the first country within 3 months, otherwise you will lose your right to unemployment benefit
ga: Mura n-éiríonn leat obair a fháil, ní mór duit taobh istigh de 3 mhí, filleadh ar an gcéad tír nó caillfidh tú an cead sochar dífhostaíochta a fháil

source: If you are leaving Ireland to move to Northern Ireland or Britain your Social Welfare Local Office will issue you with the Form U2 (formerly Form E303) which you take to the UK social services
ga: Má tá tú ag fágáil Éireann chun bogadh go Tuaisceart Éireann nó an Bhreatain, eiseoidh d'Oifig Áitiúil Leasa Shóisialaigh Foirm U2 (Foirm E303 roimhe seo) duit chun é a thógáil go dtí na seirbhísí sóisialta RA

source: If you are moving to another EU country the Department of Social Protection will send the U2 form to your new address in that EU country
ga: Má bhogann tú go tír eile san AE, seolfaidh an Roinn Coimirce Sóisialaí foirm U2 chuig do sheoladh nua sa tír AE

source: As an EU national working in another EU country you have the right to live there
ga: Mar shaoránach de thír amháin den AE atá ag obair i dtír eile den AE tá sé de cheart agat maireachtáil sa tír sin

source: You are not required to have a residence permit
ga: Níl ort ceadúnas cónaithe a fáil

source: You are subject to the same working conditions as nationals of the country you are working in as regards, for example, pay, dismissal, hours of work, maternity leave and health and safety at work
ga: Baineann na coinníollacha oibre céanna leat agus a bhaineann le saoránaigh na tíre eile, maidir le, mar shampla, pá, briseadh ón bpost, uaireanta oibre, saoire mháthaireachais, sláinte/sábháilteachas sa láthair oibre

source: You are also subject to the same conditions as nationals of the host country with regard to the principles of equality between men and women
ga: Baineann na rialacha céanna leat freisin agus a bhaineann le saoránaigh na tíre maidir le cothromaíocht idir fir agus mná

source: The basic aim of EU policy is to ensure that you are part of a social security system and that you do not lose your rights, regardless of the member state you decide to work in
ga: Tá sé mar bhunaidhm ag polasaí an AE cinntiú go bhfuil tú clúdaithe ag córas sóisialach agus nach gcailleann tú do chearta, is cuma cén ballstát a roghnaíonn tú le dul ag obair ann

source: In principle, you are insured for social security purposes in the country you work in
ga: Go bunúsach bíonn árachas sóisialta agat i bpé tír ina bhfuil tú ag obair inti

source: You, and in certain circumstances, your family are entitled to the same social security benefits as nationals of the country in which you work
ga: Bíonn tú agus, i gcásanna áirid, do theaghlach, i dteideal na sochar céanna faoin gcóras árachais shóisialta agus atá saoránaigh na tíre ina bhfuil tú ag obair inti

source: These rights cover sickness and maternity benefits, disability, old-age and survivor's benefits, benefits payable for accidents at work, occupational illness, death and unemployment, as well as family allowances
ga: Baineann na cearta seo le híocaíochtaí i gcás tinnis, máthaireachais, míchumais, seanaoise agus do mharthanóirí, sochair a íoctar tar éis timpiste ag an obair, tinneas ceirde, sochair bháis agus dífhostaíochta, chomh maith le liúntais teaghlaigh

source: You are required to pay the same level of contributions as host country nationals
ga: Tá ort na ranníocaíochtaí céanna a íoc agus a íocann saoránaigh de chuid na tíre

source: You cannot be excluded from benefits on grounds of nationality, for reasons of residence, or for any other discriminatory reason
ga: Ní féidir ar chúinsí náisiúntachta, ar chúiseanna a bhaineann le áit chónaithe, ná ar aon chúis leatroime eile diúltú sochair a íoc leat

source: You can find more information in our document, Leaving Ireland and your social security entitlements
ga: Tá tuilleadh eolais ar fáil inár ndoiciméad, Do chearta leasa shóisialta agus tú ag fágáil Éireann

source: By working in another member state and by transferring your residence there, you are likely to become "resident for tax purposes" there
ga: Trí bheith ag obair i mballstát eile agus trí aistriú ansin mar áit chónaithe, is dóigh go dtiocfaidh tú chun “cónaí chun críocha cánach” ann

source: The definition of fiscal residence varies from one member state to another
ga: Athraíonn an míniú ar chónaí fioscach ó bhallstát amháin go ballstát eile

source: You must comply with the laws of the country where you have established your residence
ga: Ní mór duit dlíthe na tíre inar bhunaigh tú d’áit chónaithe a chomhlíonadh

source: The laws on personal taxation vary considerably from one member state to another and you may be liable for taxation in more than one country
ga: Athraíonn na dlíthe maidir le cánachas pearsanta go mór ó bhallstát amháin go ballstát eile agus féadfaidh tú a bheith faoi dhliteanas cánach i níos mó ná tír amháin

source: In general, you are subject to income tax in the country where you are living but this may not be the case if you are a “posted worker” – see below
ga: Go ginearálta, tá tú faoi réir cánach sa tír ina bhfuil tú i do chónaí ach b’fhéidir nach amhlaidh a bheidh an cas más “oibrí atá curtha go dtí Ballstát eile” tú – féach thíos

source: In general, property is taxed in the country in which it is situated but, again, there are variations
ga: Go ginearálta, gearrtar cáin ar mhaoin sa tír ina bhfuil sí suite ach, arís, tá éagsúlachtaí ann

source: Tax agreements have been concluded between most of the member states of the EU, which are intended to avoid double taxation, if you derive income from different countries
ga: Tá comhaontaithe cánacha ann idir an cuid is mó den ballstáit an AE ar mhaithe le dliteanas cánach dúbailte a sheachaint, má bhíonn ioncam agat ó thíortha eagsúla

source: In general, national fiscal rules must respect the fundamental principle of non-discrimination against nationals of another EU country
ga: Go ginearálta, ní mór do na rialacha fioscacha náisiúnta aitheantas a thabhairt don bhunphrionsabal i gcoinne leatroime ar shaoránaigh de thír eile den AE

source: Workers posted to another EU country
ga: Oibrithe a sannadh chuig tír eile den AE

source: You have certain specific rights if you are a posted worker, that is, you work for a limited period of time in a member state other than the one where you normally work
ga: Tá cearta faoi leith agat má sanntar chuig tír eile thú ag obair, sin le rá go n-oibríonn tú ar feadh tréimhse teoranta i mballstát eile seachas an ceann ina mbíonn tú ag obair ann de ghnáth

source: If you are to be posted for a period of more than a month, your employer must inform you in writing, before you leave, of your pay and working conditions while you are abroad
ga: Más tréimhse de níos faide ná mí atá i gceist ní mór don fhostóir a chur in iúl duit i scríbhinn, roimh imeacht duit, cén pá agus coinníollacha oibre a bheidh agat an fhad agus a bhíonn tú ag obair thar lear

source: You will usually remain affiliated to the social security system of your country of origin
ga: De ghnáth leanfaidh tú de bheith cleamhnaithe le córas slándála sóisialaí do thíre tionscnaimh

source: You may pay income tax in that country as well but the situation varies between member states
ga: Ní mór duit cáin ioncaim a íoc sa tír sin chomh maith ach athraíonn cúrsaí idir na ballstáit

source: You can find out more about social security for posted workers in this guide or see 'further information’ below
ga: Tá sonraí ar fáil faoi theidlíochtaí sláinte agus leasa shóisialta sa Tuilleadh eolais' thíos

source: Freedom to provide services
ga: Saor le seirbhísí a chur ar fáil

source: You may choose to offer your services in another EU country without establishing yourself there permanently
ga: D'fhéadfadh sé go mbeadh tú ag iarraidh do chuid seirbhísí a chur ar fáil i dtír eile den AE ach nach mbeadh gnáthchónaí buan ort sa tír sin
